app/Controllers/Api/AdminDoctor.php

    public function index()
    {
        $data = $this->doctorModel->findAll();
---
SELECT *
FROM `doctors`

    public function show($id = null)
    {
        $doctor = $this->doctorModel->find($id);
---
SELECT *
FROM `doctors`
WHERE `doctors`.`id` = '3'