app/Controllers/Api/Appointment.php

SELECT `appointments`.*, `users`.`username`, `doctors`.`name` AS `doctor_name`, `doctors`.`specialization`, `doctors`.`schedule`, `payments`.`payment_method`, `payments`.`amount`, `payments`.`proof`
FROM `appointments`
LEFT JOIN `users` ON `users`.`id` = `appointments`.`user_id`
LEFT JOIN `doctors` ON `doctors`.`id` = `appointments`.`doctor_id`
LEFT JOIN `payments` ON `payments`.`appointment_id` = `appointments`.`id`
ORDER BY `appointments`.`id` DESC
---
    public function index()
    {
        $appointments = $this->appointmentModel
            ->select('appointments.*,
                      users.username,
                      doctors.name AS doctor_name,
                      doctors.specialization,
                      doctors.schedule,
                      payments.payment_method,
                      payments.amount,
                      payments.proof')
            ->join('users', 'users.id = appointments.user_id', 'left')
            ->join('doctors', 'doctors.id = appointments.doctor_id', 'left')
            ->join('payments', 'payments.appointment_id = appointments.id', 'left')
            ->orderBy('appointments.id', 'DESC')
            ->findAll();

INSERT INTO `appointments` (`user_id`, `doctor_id`, `date`, `time`, `keluhan`, `status`, `created_at`, `updated_at`) VALUES (21, 1, '2026-06-09', '15:00', 'pusing pengen punya banyak duit', 'pending', '2026-06-09 04:31:45', '2026-06-09 04:31:45')
---
    public function create()
    {
        $input = $this->request->getJSON(true);

        $data = [
            'user_id'   => $input['user_id'] ?? null,
            'doctor_id' => $input['doctor_id'] ?? null,
            'date'      => $input['date'] ?? null,
            'time'      => $input['time'] ?? null,
            'keluhan'   => $input['keluhan'] ?? $input['complaint'] ?? null,
            'status'    => $input['status'] ?? 'pending',
        ];

        $appointmentId = $this->appointmentModel->insert($data);

SELECT `appointments`.*, `users`.`username`, `doctors`.`name` AS `doctor_name`, `doctors`.`specialization`, `doctors`.`schedule`
FROM `appointments`
LEFT JOIN `users` ON `users`.`id` = `appointments`.`user_id`
LEFT JOIN `doctors` ON `doctors`.`id` = `appointments`.`doctor_id`
WHERE `appointments`.`id` = 5
 LIMIT 1
---
    public function update($id = null)
    {
        $appointment = $this->appointmentModel->find($id);