app/Controllers/Api/AppointmentController.php

SELECT `appointments`.*, `doctors`.`name` AS `doctor_name`, `doctors`.`specialization`
FROM `appointments`
LEFT JOIN `doctors` ON `doctors`.`id` = `appointments`.`doctor_id`
WHERE `appointments`.`user_id` = 21
ORDER BY `appointments`.`id` DESC
---
    public function index()
    {
        $hasUsersTable = $this->hasUsersTable();
        $model = (new AppointmentModel())
            ->select($this->appointmentSelect($hasUsersTable))
            ->join('doctors', 'doctors.id = appointments.doctor_id', 'left')
            ->orderBy('appointments.id', 'DESC');

        if ($hasUsersTable) {
            $model->join('users', 'users.id = appointments.user_id', 'left');
        }

        $userId = $this->currentUserId();
        if ($userId !== null) {
            $model->where('appointments.user_id', $userId);
        }

        $appointments = array_map(fn (array $appointment): array => $this->formatAppointment($appointment), $model->findAll());