app/Controllers/Api/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function login()
    {
        $input = $this->getJsonInput();
        $login = trim($input['login'] ?? $input['email'] ?? $input['username'] ?? '');
        $password = (string) ($input['password'] ?? '');

        if ($login === '' || $password === '') {
            return $this->respondAuth(422, false, 'Email/username dan password wajib diisi.');
        }

        $userModel = new UserModel();
        $field = filter_var($login, FILTER_VALIDATE_EMAIL) ? 'email' : 'username';
        $user = $userModel->where($field, $login)->first();