app/Controllers/Api/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'sherin@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function login()
    {
        $input = $this->input();
        if (($invalidJson = $this->invalidJsonResponse()) !== null) {
            return $invalidJson;
        }

        $login = trim((string) ($input['login'] ?? $input['email'] ?? ''));
        $password = (string) ($input['password'] ?? '');

        if ($login === '' || $password === '') {
            return $this->failure('Login dan password wajib diisi.', [], 422);
        }

        $field = filter_var($login, FILTER_VALIDATE_EMAIL) ? 'email' : 'username';
        $user = (new UserModel())->where($field, $login)->first();