app/Controllers/Api/Dashboard.php

    public function index()
    {
        $userModel        = new UserModel();
        $appointmentModel = new AppointmentModel();
        $doctorModel      = new DoctorModel();
        $kontakModel      = new KontakModel();

        $data = [
            'total_users'        => $userModel->countAll(),
            'total_doctors'      => $doctorModel->countAll(),
            'today_appointments' => $appointmentModel
                                        ->where('date', date('Y-m-d'))
                                        ->countAllResults(),
            'total_contacts'     => $kontakModel->countAllResults(),
            'latest_contacts'    => $kontakModel
                                        ->orderBy('created_at', 'DESC')
                                        ->findAll(5)
---
SELECT COUNT(*) AS `numrows` FROM `doctors`
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `date` = '2026-06-04'
SELECT COUNT(*) AS `numrows`
FROM `kontak`
SELECT *
FROM `kontak`
ORDER BY `created_at` DESC
 LIMIT 5