app/Controllers/Api/Doctors.php

    public function index()
    {
        $doctors = $this->doctorModel->findAll();
---
SELECT *
FROM `doctors`