app/Controllers/Api/DoctorController.php

SELECT *
FROM `doctors`
---
    public function index()
    {
        $model = new DoctorModel();
        $specialization = $this->request->getGet('specialization');

        if ($specialization !== null && $specialization !== '') {
            $model->like('specialization', $specialization);
        }

        $doctors = array_map(fn (array $doctor): array => $this->formatDoctor($doctor), $model->findAll());