app/Controllers/Api/Payment.php

    public function create()
    {
        $input = $this->input();
        if (($invalidJson = $this->invalidJsonResponse()) !== null) {
            return $invalidJson;
        }

        $appointmentId = $input['booking_id'] ?? $input['id_booking'] ?? null;

        if (! is_numeric($appointmentId)) {
            return $this->failure('booking_id wajib berupa ID appointment.', [], 422);
        }

        $appointment = $this->appointmentModel->find((int) $appointmentId);
        if (! $appointment) {
            return $this->failure('Booking tidak ditemukan.', [], 404);
        }

        $paymentMethod = $input['payment_method'] ?? $input['metode_pembayaran'] ?? 'QRIS';
        $amount = $input['amount'] ?? $input['total'] ?? 0;
        $paymentSaved = $this->savePaymentIfTableIsUsable((int) $appointmentId, $paymentMethod, $amount, $input);

        $queueNumber = $appointment['no_antrian'];
        if ($queueNumber === null || $queueNumber === '') {
            $last = $this->appointmentModel
                ->where('date', $appointment['date'])
                ->selectMax('no_antrian')
                ->first();
---
SELECT *
FROM `appointments`
WHERE `appointments`.`id` = 7
INSERT INTO `payments` (`appointment_id`, `payment_method`, `amount`, `status`, `proof`, `bukti`) VALUES (7, 'qris', 0, 'confirmed', NULL, NULL)
SELECT MAX(`no_antrian`) AS `no_antrian`
FROM `appointments`
WHERE `date` = '2026-06-10'
 LIMIT 1

            $queueNumber = ((int) ($last['no_antrian'] ?? 0)) + 1;
        }

        $this->appointmentModel->update((int) $appointmentId, [
            'status' => 'confirmed',
            'no_antrian' => $queueNumber,
        ]);
---
UPDATE `appointments` SET `status` = 'confirmed', `no_antrian` = 1, `updated_at` = '2026-06-10 01:52:30'
WHERE `appointments`.`id` IN (7)