app/Controllers/Api/ProfileController.php

    public function show()
    {
        $userId = $this->currentUserId();
        if ($userId === null) {
            return $this->failure('Token autentikasi diperlukan.', [], 401);
        }

        $user = (new UserModel())->find($userId);

        if ($user === null) {
            return $this->failure('User tidak ditemukan.', [], 404);
        }

        try {
            $profile = (new ProfileModel())->where('user_id', $userId)->first();
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = 20
SELECT *
FROM `profiles`
WHERE `user_id` = 20
 LIMIT 1