app/Controllers/Admin/Appointment.php

SELECT `appointments`.*, `users`.`username`, `doctors`.`name` AS `doctor_name`, `payments`.`proof`
FROM `appointments`
LEFT JOIN `users` ON `users`.`id` = `appointments`.`user_id`
LEFT JOIN `doctors` ON `doctors`.`id` = `appointments`.`doctor_id`
LEFT JOIN `payments` ON `payments`.`appointment_id` = `appointments`.`id`
ORDER BY `appointments`.`id` ASC
---
    public function index()
    {
        $appointmentModel = new AppointmentModel();

        $data['appointments'] = $appointmentModel
            ->select('appointments.*,
                      users.username,
                      doctors.name AS doctor_name,
                      payments.proof')
            ->join('users', 'users.id = appointments.user_id', 'left')
            ->join('doctors', 'doctors.id = appointments.doctor_id', 'left')
            ->join('payments', 'payments.appointment_id = appointments.id', 'left')
            ->orderBy('appointments.id', 'ASC')
            ->findAll();