app/Controllers/Home.php

SELECT `appointments`.`id`, `appointments`.`date`, `appointments`.`time`, `appointments`.`status`, `appointments`.`no_antrian`, `doctors`.`name` AS `doctor_name`, `users`.`username` AS `patient_name`
FROM `appointments`
JOIN `doctors` ON `doctors`.`id` = `appointments`.`doctor_id`
JOIN `users` ON `users`.`id` = `appointments`.`user_id`
WHERE `appointments`.`user_id` = '16'
ORDER BY `appointments`.`id` DESC
---
    public function history()
    {
        if (!logged_in()) {
            return redirect()->to('/login');
        }

        $appointmentModel = new AppointmentModel();
        $userId = user_id();

        $appointments = $appointmentModel
            ->select('appointments.id,
                  appointments.date,
                  appointments.time,
                  appointments.status,
                  appointments.no_antrian,
                  doctors.name AS doctor_name,
                  users.username AS patient_name')
            ->join('doctors', 'doctors.id = appointments.doctor_id')
            ->join('users', 'users.id = appointments.user_id')
            ->where('appointments.user_id', $userId)
            ->orderBy('appointments.id', 'DESC')
            ->findAll();