app/Models/ApiTokenModel.php

    public function issueToken(int $userId, ?string $name = null): string
    {
        $plainToken = bin2hex(random_bytes(32));

        $this->insert([
            'user_id'    => $userId,
            'token_hash' => hash('sha256', $plainToken),
            'name'       => $name,
            'expires_at' => date('Y-m-d H:i:s', time() + (30 * DAY)),
        ]);
---
INSERT INTO `api_tokens` (`user_id`, `token_hash`, `name`, `expires_at`, `created_at`, `updated_at`) VALUES (22, 'd048be243a5bfb01d26fb3a0d0427053ebf3576ea67aeeeb0d4859c8e6f38174', 'Postman', '2026-06-25 03:23:41', '2026-05-26 03:23:41', '2026-05-26 03:23:41')

    public function findActiveToken(string $plainToken): ?array
    {
        $token = $this->where('token_hash', hash('sha256', $plainToken))
            ->where('revoked_at', null)
            ->first();
---
SELECT *
FROM `api_tokens`
WHERE `token_hash` = '326ccce19720efa892046e9d4662a0753926aebb05f292ac9bc27f34bf9b65be'
AND `revoked_at` IS NULL
 LIMIT 1

    public function markUsed(int $id): void
    {
        $this->update($id, ['last_used_at' => date('Y-m-d H:i:s')]);
---
UPDATE `api_tokens` SET `last_used_at` = '2026-05-25 16:20:32', `updated_at` = '2026-05-25 16:20:32'
WHERE `api_tokens`.`id` IN (1)